espressif/esp-idf/components/pthread/test_apps/pthread_unity_tests/sdkconfig.ci.single_core_esp32_tls
CONFIG_IDF_TARGET="esp32"
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
